# Azimuth Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisSurface..::..Azimuth Property
EnergyAnalysisSurface Class See Also
---
The azimuth angle for this surface.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double Azimuth { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Azimuth As Double
	Get
```

Visual C++
---
```text
public:
property double Azimuth {
	double get ();
}
```

# Remarks
The azimuth is computed as the angle of rotation between the outward normal of the surface and the Y-axis (clockwise is positive).
# See Also
EnergyAnalysisSurface Class
Autodesk.Revit.DB.Analysis Namespace